# Homebrew bundle
# @see https://github.com/Homebrew/homebrew-bundle

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/apache'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'buo/cask-upgrade'

brew 'ack'
brew 'ant'
brew 'apr-util'
brew 'apr'
brew 'autoconf'
brew 'autojump'
brew 'dnsmasq', service_restart: true
brew 'freetype'
brew 'gettext'
brew 'git-extras'
brew 'git'
brew 'gnu-tar'
brew 'go'
brew 'httpd', args: ['with-mpm-event']
brew 'icu4c'
brew 'imagemagick'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'makedepend'
brew 'mas'
brew 'maven'
brew 'mysql', service_restart: true
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'ripgrep'
brew 'tig'
brew 'unixodbc'
brew 'unrar'
brew 'xz'
brew 'z'
brew 'zlib'
brew 'zsh-completions'
brew 'watchman'

brew 'homebrew/php/composer'
brew 'homebrew/php/php70'
brew 'homebrew/php/php70-apcu'
brew 'homebrew/php/php70-apcu-bc'
brew 'homebrew/php/php70-imagick', args: ['build-from-source']
brew 'homebrew/php/php70-intl'
brew 'homebrew/php/php70-opcache'
brew 'homebrew/php/php70-xdebug'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'betterzip'
cask 'cleanmymac'
cask 'colorpicker-skalacolor'
cask 'dash'
cask 'default-folder-x'
cask 'divvy'
cask 'dropbox'
cask 'dropshare'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'font-anonymous-pro'
cask 'font-camingocode'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'google-chrome'
cask 'harvest'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'name-mangler'
cask 'opera'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'sonos'
cask 'spectacle'
cask 'spillo'
cask 'spotify'
cask 'transmission'
cask 'typinator'
cask 'virtualbox'
cask 'vlc'
cask 'wkhtmltopdf'

mas 'DiveLogManager (3.4.28)', id: 404897036
mas 'JPEGmini (1.9.9)', id: 498944723
mas 'Keynote (7.0)', id: 409183694
mas 'Mousepose (3.2.7)', id: 405904955
mas 'Noizio (1.5)', id: 928871589
mas 'Numbers (4.0)', id: 409203825
mas 'Pages (6.0)', id: 409201541
mas 'SiteSucker (2.9)', id: 442168834
mas 'SonicWALL Mobile Connect (4.0.8)', id: 822514576
mas 'Tweetbot (2.4.4)', id: 557168941
mas 'Wunderlist (3.4.5)', id: 410628904
