# @IgnoreInspection BashAddShebang
#
# Homebrew bundle
# @see https://github.com/Homebrew/homebrew-bundle

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
#tap 'homebrew/apache'
#tap 'homebrew/bundle'
tap 'homebrew/core'
#tap 'homebrew/dupes'
#tap 'homebrew/php'
tap 'homebrew/services'
#tap 'homebrew/versions'
#tap 'buo/cask-upgrade'

#brew 'ack'
#brew 'ant'
#brew 'apr-util'
#brew 'apr'
#brew 'autoconf'
#brew 'dnsmasq', service_restart: true
#brew 'freetype'
#brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'gnu-tar'
#brew 'go'
#brew 'httpd', args: ['with-mpm-event']
brew 'httpie'
#brew 'icu4c'
#brew 'imagemagick'
#brew 'jpeg'
brew 'jenv'
#brew 'libpng'
#brew 'libtiff'
#brew 'libtool'
#brew 'libxml2'
#brew 'makedepend'
brew 'maven'
brew 'mas'
brew 'mkcert'
brew 'mysql', service_restart: true
brew 'nss'
brew 'node'
#brew 'openssl'
#brew 'pcre'
#brew 'pkg-config'
#brew 'readline'
#brew 'ripgrep'
#brew 'tig'
#brew 'unixodbc'
brew 'unrar'
#brew 'xz'
brew 'z'
#brew 'zlib'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

#brew 'homebrew/php/composer'
#brew 'homebrew/php/php70'
#brew 'homebrew/php/php70-apcu'
#brew 'homebrew/php/php70-apcu-bc'
#brew 'homebrew/php/php70-imagick', args: ['build-from-source']
#brew 'homebrew/php/php70-intl'
#brew 'homebrew/php/php70-opcache'
#brew 'homebrew/php/php70-xdebug'

#cask '1password'
cask 'alfred'
cask 'betterzip'
cask 'cleanmymac'
cask 'colorpicker-skalacolor'
cask 'dash'
cask 'default-folder-x'
cask 'dropbox'
cask 'dropshare'
#cask 'evernote'
#cask 'fantastical'
#cask 'firefox'
#cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'name-mangler'
#cask 'opera'
cask 'sequel-pro'
#cask 'sketch'
#cask 'slack'
#cask 'sonos'
cask 'spectacle'
cask 'spillo'
cask 'spotify'
#cask 'transmission'
cask 'timer'
cask 'typinator'
#cask 'virtualbox'
cask 'vlc'
#cask 'wkhtmltopdf'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-fira-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'

# App Store Applications
mas 'Affinity', id: 824183456
mas 'Bear', id: 1091189122
#mas 'DiveLogManager', id: 404897036
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
#mas 'Magnet', id: 441258766
#mas 'Mousepose', id: 405904955
mas 'Noizio', id: 928871589
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
#mas 'Rested', id: 421879749
#mas 'SiteSucker', id: 442168834
mas 'Slack', id: 803453959
#mas 'SonicWall', id: 822514576
#mas 'Table', id: 1122008420
mas 'Telegram', id: 747648890
mas 'Todoist', id: 585829637
#mas 'Trello', id: 1278508951
mas 'Tweetbot', id: 557168941
mas 'Wunderlist', id: 410628904
#mas 'Xcode', id: 497799835

