# @IgnoreInspection BashAddShebang
#
# Homebrew bundle
# @see https://github.com/Homebrew/homebrew-bundle

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/core'
tap 'homebrew/services'
# Non-Free Fonts
# @see https://github.com/colindean/homebrew-fonts-nonfree
tap 'colindean/fonts-nonfree'

#brew 'ack'
#brew 'ant'
#brew 'apr-util'
#brew 'apr'
#brew 'autoconf'
brew 'bat'
#brew 'freetype'
#brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'gnu-tar'
#brew 'go'
brew 'httpd', restart_service: true
brew 'httpie'
#brew 'icu4c'
#brew 'imagemagick'
#brew 'jpeg'
brew 'jenv'
#brew 'libpng'
#brew 'libtiff'
#brew 'libtool'
#brew 'libxml2'
#brew 'makedepend'
brew 'maven'
brew 'mas'
brew 'mkcert'
brew 'mysql@5.7', restart_service: true, link: true, conflicts_with: ['mysql']
# brew 'node', args: ['--without-npm']
brew 'nss'
#brew 'openssl'
#brew 'pcre'
brew 'php', restart_service: true
#brew 'pkg-config'
#brew 'readline'
#brew 'ripgrep'
brew 'rbenv'
brew 'tig'
#brew 'unixodbc'
brew 'unrar'
#brew 'xz'
brew 'z'
#brew 'zlib'
brew 'watchman'
brew 'wget'
brew 'yarn', args: ['without-node']
# brew 'yarn'
brew 'youtube-dl'
brew 'vagrant'

#cask '1password' # Because we don't want the newest >6.x version which is subscription based…
cask 'alfred'
cask 'betterzip'
cask 'colorpicker-skalacolor'
cask 'dash'
cask 'daisydisk'
cask 'default-folder-x'
cask 'dropbox'
cask 'dropshare'
cask 'evernote'
#cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'gemini'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'name-mangler'
#cask 'opera'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
#cask 'slack'
#cask 'sonos'
cask 'spectacle'
cask 'spillo'
cask 'spotify'
cask 'transmission'
cask 'timer'
#cask 'virtualbox'
cask 'vlc'
#cask 'wkhtmltopdf'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-fira-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-microsoft-office'

# Quick Look plugins
# @see https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'qlvideo'

# App Store Applications
mas 'Affinity', id: 824183456
#mas 'Bear', id: 1091189122
#mas 'DiveLogManager', id: 404897036
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
#mas 'Magnet', id: 441258766
#mas 'Mousepose', id: 405904955
mas 'Noizio', id: 928871589
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
#mas 'Rested', id: 421879749
mas 'SiteSucker', id: 442168834
mas 'Slack', id: 803453959
#mas 'SonicWall', id: 822514576
#mas 'Table', id: 1122008420
mas 'Telegram', id: 747648890
#mas 'Todoist', id: 585829637
mas 'Trello', id: 1278508951
mas 'Tweetbot', id: 557168941
#mas 'Wunderlist', id: 410628904
mas 'Xcode', id: 497799835
mas 'ColorSlurp', id: 1287239339
